Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MDA_FocController_F16.c
/*
 * Copyright (c) 2024 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

/******************************************************************************/
/*----------------------------------Includes----------------------------------*/
/******************************************************************************/

#include "Ifx_MDA_FocController_F16.h"
#include "Ifx_MDA_FocController_F16_Cfg.h"

/* C library */
#include "stddef.h"

/* Math library includes */
#include "Ifx_Math_CartToPolar.h"
#include "Ifx_Math_Interp1DLut.h"
#include "Ifx_Math_Park.h"
#include "Ifx_Math_PolarToCart.h"
#include "Ifx_Math_Arithmetic_F16.h"

/* CMSIS includes */
#include "cmsis_compiler.h"

/******************************************************************************/
/*-----------------------------------Macros-----------------------------------*/
/******************************************************************************/
/* Macros to define the component ID */
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_SOURCEID     ((uint8_t)Ifx_ComponentID_SourceID_infineonTechnologiesAG)
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_LIBRARYID    ((uint16_t)Ifx_ComponentID_LibraryID_mctrlDriveAlgorithm)
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_MODULEID     (1U)
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_COMPONENTID1 (1U)
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_COMPONENTID2 ((uint8_t)Ifx_ComponentID_ComponentID2_basic)

/* Macros to define the component version */
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_MAJOR   (2U)
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_MINOR   (0U)
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_PATCH   (0U)
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_T       (4U)
#define IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_REV     (0U)

/* Shift factor for getting index from Amplitude table */
#define IFX_MDA_FOCCONTROLLER_F16_SHIFT \
    (15 - IFX_MATH_MOTORCONTROLMATH_F16_CFG_CARTTOPOLAR_LUT_SIZE)

/* Modulation index max for linear region, normalized by 2/pi */
#define IFX_MDA_FOCCONTROLLER_F16_CONST_MI_0907_Q15        (18921)

/* Scaling factor used to up shift 16bits of Ifx_Math_Fract16Q(variable Qformat) value to store it in a uint32 variable
 * for transfer.
 * Todo: Move as fixed 16 bit shift into math function and remove as parameter? Is independent of TU decimal places.*/
#define IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU     65536U

/******************************************************************************/
/*-----------------------Private Function Prototypes--------------------------*/
/******************************************************************************/
/* *INDENT-OFF* */
/**
 * \brief Uses the Math ConvToQForm function to convert the gains of the D current PI controller to Q format
 */
static inline void Ifx_MDA_FocController_F16_convDPiGainsToQ(Ifx_MDA_FocController_F16_Param* param,
                                                             Ifx_Math_Fract16Q* propGain,
                                                             Ifx_Math_Fract16Q* integGainSamplingTime,
                                                             Ifx_Math_Fract16Q* antiWindupGainSamplingTime);
/**
 * \brief Initializes the dynamic parameters of the D current PI
 */
static inline void Ifx_MDA_FocController_F16_initDPiDynParam(Ifx_MDA_FocController_F16* self,
                                                             Ifx_Math_Fract16Q propGain,
                                                             Ifx_Math_Fract16Q integGainSamplingTime,
                                                             Ifx_Math_Fract16Q antiWindupGainSamplingTime);
/**
 * \brief Uses the Math ConvToQForm function to convert the gains of the Q current PI controller to Q format
 */
static inline void Ifx_MDA_FocController_F16_convQPiGainsToQ(Ifx_MDA_FocController_F16_Param* param,
                                                             Ifx_Math_Fract16Q* propGain, 
                                                             Ifx_Math_Fract16Q* integGainSamplingTime,
                                                             Ifx_Math_Fract16Q* antiWindupGainSamplingTime);
/**
 * \brief Initializes the dynamic parameters of the Q current PI
 */
static inline void Ifx_MDA_FocController_F16_initQPiDynParam(Ifx_MDA_FocController_F16* self,
                                                             Ifx_Math_Fract16Q propGain,
                                                             Ifx_Math_Fract16Q integGainSamplingTime,
                                                             Ifx_Math_Fract16Q antiWindupGainSamplingTime);
/* *INDENT-ON* */

/**
 * \brief Calculate and return the difference between the dq current command and the actual dq currents
 */
static inline Ifx_Math_CmpFract16 Ifx_MDA_FocController_F16_calcCurrentErrorsQ14(Ifx_Math_CmpFract16 currentDQ,
                                                                                 Ifx_Math_CmpFract16 dqCommand);

#if IFX_MDA_FOCCONTROLLER_F16_CFG_DQDECOUPLINGENABLE

/* Local function to execute d-q decoupling */
static inline void Ifx_MDA_FocController_F16_dqDecoupling(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                          electricalSpeed);
#endif /* IFX_MDA_FOCCONTROLLER_F16_CFG_DQDECOUPLINGENABLE */
/* Local functions to initialize d and q PI controllers */
static inline void Ifx_MDA_FocController_F16_initDPi(Ifx_MDA_FocController_F16* self);
static inline void Ifx_MDA_FocController_F16_initQPi(Ifx_MDA_FocController_F16* self);

