Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MDA_FocController_F16.c
#if IFX_MDA_FOCCONTROLLER_F16_CFG_LIMIT_VOLT_VECTOR_D_PRIO

/* Local functions to limit D and Q voltages */
static inline void Ifx_MDA_FocController_F16_limitDQVoltage(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                            dcLinkVoltageQ15);
static inline void Ifx_MDA_FocController_F16_limitDVoltage(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                           maxAmpQ15);
static inline void Ifx_MDA_FocController_F16_limitQVoltage(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                           maxAmpQ15);
#endif /* IFX_MDA_FOCCONTROLLER_F16_CFG_LIMIT_VOLT_VECTOR_D_PRIO */
/******************************************************************************/
/*------------------------Private Variables/Constants-------------------------*/
/******************************************************************************/
/* *INDENT-OFF* */
/* Component ID */
static const Ifx_ComponentID      Ifx_MDA_FocController_F16_componentID = {
    .sourceID     = IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_SOURCEID,
    .libraryID    = IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_LIBRARYID,
    .moduleID     = IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_MODULEID,
    .componentID1 = IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_COMPONENTID1,
    .componentID2 = IFX_MDA_FOCCONTROLLER_F16_COMPONENTID_COMPONENTID2,
};

/* Component Version */
static const Ifx_ComponentVersion Ifx_MDA_FocController_F16_componentVersion = {
    .major = IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_MAJOR,
    .minor = IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_MINOR,
    .patch = IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_PATCH,
    .t     = IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_T,
    .rev   = IFX_MDA_FOCCONTROLLER_F16_COMPONENTVERSION_REV
};

#if IFX_MDA_FOCCONTROLLER_F16_CFG_LIMIT_VOLT_VECTOR_D_PRIO

/* Link to lookup table */
static const Ifx_Math_Interp1DLut_Type focControllerInterp1DLut = {
    .data = &Ifx_Math_Lut_CartToPolar_F16_table[0],
    .size = (((uint16_t)1 << IFX_MATH_MOTORCONTROLMATH_F16_CFG_CARTTOPOLAR_LUT_SIZE) + 1)
};

#endif /* IFX_MDA_FOCCONTROLLER_F16_CFG_LIMIT_VOLT_VECTOR_D_PRIO */

/******************************************************************************/
/*-----------------------Exported Variables/Constants-------------------------*/
/******************************************************************************/
/* temporary solution, XML_VERSION indicates if static cfg is generated by cfgwiz */
#ifdef IFX_MDA_FOCCONTROLLER_F16_CFG_XML_VERSION
/* Default parameters initialized with CfgWizard defines */
Ifx_MDA_FocController_F16_Param Ifx_MDA_FocController_F16_g_defaultParam =
{
    .currentDPiPropGain                   = IFX_MDA_FOCCONTROLLER_F16_CFG_ID_PI_PROPGAIN_TU,
    .currentDPiIntegGainSamplingTime      = IFX_MDA_FOCCONTROLLER_F16_CFG_ID_PI_KI_TS_TU,
    .currentDPiAntiWindupGainSamplingTime = IFX_MDA_FOCCONTROLLER_F16_CFG_ID_PI_KAW_TS_TU,
    .currentDPiUpperLimitQ15              = IFX_MDA_FOCCONTROLLER_F16_CFG_ID_PI_OUT_UPP_LIMIT_Q,
    .currentDPiLowerLimitQ15              = IFX_MDA_FOCCONTROLLER_F16_CFG_ID_PI_OUT_LOW_LIMIT_Q,
    .currentQPiPropGain                   = IFX_MDA_FOCCONTROLLER_F16_CFG_IQ_PI_PROPGAIN_TU,
    .currentQPiIntegGainSamplingTime      = IFX_MDA_FOCCONTROLLER_F16_CFG_IQ_PI_KI_TS_TU,
    .currentQPiAntiWindupGainSamplingTime = IFX_MDA_FOCCONTROLLER_F16_CFG_IQ_PI_KAW_TS_TU,
    .currentQPiUpperLimitQ15              = IFX_MDA_FOCCONTROLLER_F16_CFG_IQ_PI_OUT_UPP_LIMIT_Q,
    .currentQPiLowerLimitQ15              = IFX_MDA_FOCCONTROLLER_F16_CFG_IQ_PI_OUT_LOW_LIMIT_Q,
};
#endif
/* *INDENT-ON* */
/******************************************************************************/
/*-------------------------Function Implementations---------------------------*/
/******************************************************************************/
/* Function to get the component ID */
void Ifx_MDA_FocController_F16_getID(const Ifx_ComponentID** componentID)
{
    *componentID = &Ifx_MDA_FocController_F16_componentID;
}


/* Function to get the component version */
void Ifx_MDA_FocController_F16_getVersion(const Ifx_ComponentVersion** componentVersion)
{
    *componentVersion = &Ifx_MDA_FocController_F16_componentVersion;
}


void Ifx_MDA_FocController_F16_init(Ifx_MDA_FocController_F16* self, Ifx_MDA_FocController_F16_Param* param)
{
    /* Initialize pointer to parameter structure */
    self->param = param;

    /* Initialize internal variables and outputs to 0 */
    self->currentDQ.real                         = 0;
    self->currentDQ.imag                         = 0;
    self->voltageDQ.real                         = 0;
    self->voltageDQ.imag                         = 0;
    self->p_output.voltageCommandPolar.amplitude = 0;
    self->p_output.voltageCommandPolar.angle     = 0;

    /* Initialize Id PI controller */
    Ifx_MDA_FocController_F16_initDPi(self);

    /* Initialize Iq PI controller */
    Ifx_MDA_FocController_F16_initQPi(self);

    /* Initialize d-q decoupling */
#if IFX_MDA_FOCCONTROLLER_F16_CFG_DQDECOUPLINGENABLE
    Ifx_Math_DqDecoupling_F16_init(&(self->dqDecoupling));
    Ifx_Math_DqDecoupling_F16_setInductanceD(&(self->dqDecoupling),
        IFX_MDA_FOCCONTROLLER_F16_CFG_DIRECT_INDUCTANCE_Q15);
    Ifx_Math_DqDecoupling_F16_setInductanceQ(&(self->dqDecoupling),
        IFX_MDA_FOCCONTROLLER_F16_CFG_QUADRATURE_INDUCTANCE_Q15);
#endif /* IFX_MDA_FOCCONTROLLER_F16_CFG_DQDECOUPLINGENABLE */
}


static inline Ifx_Math_CmpFract16 Ifx_MDA_FocController_F16_calcCurrentErrorsQ14(Ifx_Math_CmpFract16 currentDQ,
                                                                                 Ifx_Math_CmpFract16 dqCommand)
{
    Ifx_Math_CmpFract16 errorCurrentDQ;
    errorCurrentDQ.real = Ifx_Math_Sub_F16(Ifx_Math_ShR_F16(dqCommand.real, 1U), Ifx_Math_ShR_F16(currentDQ.real,
        1U));
    errorCurrentDQ.imag = Ifx_Math_Sub_F16(Ifx_Math_ShR_F16(dqCommand.imag, 1U), Ifx_Math_ShR_F16(currentDQ.imag,
        1U));

    return errorCurrentDQ;
}


/* polyspace +2 CODE-METRIC:PARAM [Justified:Medium] "Increased complexity is justified to keep the functionality of
 * the component the same." */
__USED void Ifx_MDA_FocController_F16_execute(Ifx_MDA_FocController_F16* self, Ifx_Math_CmpFract16 currentAlphaBeta,
                                              Ifx_Math_CmpFract16 dqCommand, uint32_t rotorFluxAngle, Ifx_Math_Fract16
                                              electricalSpeed, Ifx_Math_Fract16
                                              dcLinkVoltageQ15)
{
    /* Current Park trans. (alpha-beta to d-q) */
    self->currentDQ = Ifx_Math_Park_F16(currentAlphaBeta, rotorFluxAngle);

    /* Calculate the current errors */
    Ifx_Math_CmpFract16 currentErrorsQ14 = Ifx_MDA_FocController_F16_calcCurrentErrorsQ14(self->currentDQ, dqCommand);

    /* Execute current PI controllers */
    self->voltageDQ.real = Ifx_Math_Pi_F16_execute(&(self->currentDPi), currentErrorsQ14.real,
        self->p_dAntiwindupCtrl);
    self->voltageDQ.imag = Ifx_Math_Pi_F16_execute(&(self->currentQPi), currentErrorsQ14.imag,
        self->p_qAntiwindupCtrl);

#if IFX_MDA_FOCCONTROLLER_F16_CFG_DQDECOUPLINGENABLE

    /* Execute d-q decoupling */
    Ifx_MDA_FocController_F16_dqDecoupling(self, electricalSpeed);
#else

    /* Suppress compiler warning */
    (void)electricalSpeed;
#endif /* IFX_MDA_FOCCONTROLLER_F16_CFG_DQDECOUPLINGENABLE */

