Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MDA_FocController_F16.c
#if IFX_MDA_FOCCONTROLLER_F16_CFG_LIMIT_VOLT_VECTOR_D_PRIO

    /* Limit calculated D and Q voltages according to the available DC link voltage with a D component prioritization */
    Ifx_MDA_FocController_F16_limitDQVoltage(self, dcLinkVoltageQ15);
#endif /* IFX_MDA_FOCCONTROLLER_F16_CFG_LIMIT_VOLT_VECTOR_D_PRIO */
    /* Voltage cartesian to polar (d-q to angle-amp) */
    self->p_output.voltageCommandPolar = Ifx_Math_CartToPolar_F16(self->voltageDQ);

    /* Add rotor flux angle to convert from d-q to alpha-beta */
    self->p_output.voltageCommandPolar.angle += rotorFluxAngle;
}


void Ifx_MDA_FocController_F16_reset(Ifx_MDA_FocController_F16* self)
{
    /* Reset intermediate variables and outputs */
    self->currentDQ.real                         = 0;
    self->currentDQ.imag                         = 0;
    self->voltageDQ.real                         = 0;
    self->voltageDQ.imag                         = 0;
    self->p_output.voltageCommandPolar.amplitude = 0;
    self->p_output.voltageCommandPolar.angle     = 0;

    /* Reset PI controllers previous values */
    Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->currentDPi), 0);
    Ifx_Math_Pi_F16_setIntegPreviousValue(&(self->currentQPi), 0);
}


static inline void Ifx_MDA_FocController_F16_convDPiGainsToQ(Ifx_MDA_FocController_F16_Param* param,
                                                             Ifx_Math_Fract16Q              * propGain,
                                                             Ifx_Math_Fract16Q              * integGainSamplingTime,
                                                             Ifx_Math_Fract16Q              *
                                                             antiWindupGainSamplingTime)
{
    *propGain                   = Ifx_Math_ConvToQForm_F16(param->currentDPiPropGain,
        IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);
    *integGainSamplingTime      = Ifx_Math_ConvToQForm_F16(param->currentDPiIntegGainSamplingTime,
        IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);
    *antiWindupGainSamplingTime = Ifx_Math_ConvToQForm_F16(param->currentDPiAntiWindupGainSamplingTime,
        IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);
}


static inline void Ifx_MDA_FocController_F16_initDPiDynParam(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16Q
                                                             propGain, Ifx_Math_Fract16Q integGainSamplingTime,
                                                             Ifx_Math_Fract16Q antiWindupGainSamplingTime)
{
    /* Set the dynamic parameters of the D current PI */
    Ifx_Math_Pi_F16_setPropGain(&(self->currentDPi), propGain);
    Ifx_Math_Pi_F16_setIntegGainSamplingTime(&(self->currentDPi), integGainSamplingTime);
    Ifx_Math_Pi_F16_setAntiWindupGainSamplingTime(&(self->currentDPi), antiWindupGainSamplingTime);
    Ifx_Math_Pi_F16_setUpperLimit(&(self->currentDPi), self->param->currentDPiUpperLimitQ15);
    Ifx_Math_Pi_F16_setLowerLimit(&(self->currentDPi), self->param->currentDPiLowerLimitQ15);
}


static inline void Ifx_MDA_FocController_F16_initDPi(Ifx_MDA_FocController_F16* self)
{
    /* Convert the gains to Q format */
    Ifx_Math_Fract16Q propGain;
    Ifx_Math_Fract16Q integGainSamplingTime;
    Ifx_Math_Fract16Q antiWindupGainSamplingTime;
    Ifx_MDA_FocController_F16_convDPiGainsToQ(self->param, &propGain, &integGainSamplingTime,
        &antiWindupGainSamplingTime);

    /* Initialize the q formats for the D current PI controller */
    Ifx_Math_Pi_F16_Qformats piQForm = {
        .qFormatError = Ifx_Math_FractQFormat_q14, .qFormatOutput = Ifx_Math_FractQFormat_q15
    };

    /* Initialize the q formats for the D current PI controller */
    Ifx_Math_Pi_F16_init(&(self->currentDPi), piQForm);

    /* Initialize the dynamic parameters of the D current PI controller */
    Ifx_MDA_FocController_F16_initDPiDynParam(self, propGain, integGainSamplingTime, antiWindupGainSamplingTime);

    /* Set antiwindup flag to inactive */
    self->p_dAntiwindupCtrl = Ifx_Math_Pi_F16_AntiWindupCtrl_no;
}


static inline void Ifx_MDA_FocController_F16_convQPiGainsToQ(Ifx_MDA_FocController_F16_Param* param,
                                                             Ifx_Math_Fract16Q              * propGain,
                                                             Ifx_Math_Fract16Q              * integGainSamplingTime,
                                                             Ifx_Math_Fract16Q              *
                                                             antiWindupGainSamplingTime)
{
    *propGain                   = Ifx_Math_ConvToQForm_F16(param->currentQPiPropGain,
        IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);
    *integGainSamplingTime      = Ifx_Math_ConvToQForm_F16(param->currentQPiIntegGainSamplingTime,
        IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);
    *antiWindupGainSamplingTime = Ifx_Math_ConvToQForm_F16(param->currentQPiAntiWindupGainSamplingTime,
        IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);
}


static inline void Ifx_MDA_FocController_F16_initQPiDynParam(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16Q
                                                             propGain, Ifx_Math_Fract16Q integGainSamplingTime,
                                                             Ifx_Math_Fract16Q antiWindupGainSamplingTime)
{
    /* Set the dynamic parameters of the current PI */
    Ifx_Math_Pi_F16_setPropGain(&(self->currentQPi), propGain);
    Ifx_Math_Pi_F16_setIntegGainSamplingTime(&(self->currentQPi), integGainSamplingTime);
    Ifx_Math_Pi_F16_setAntiWindupGainSamplingTime(&(self->currentQPi), antiWindupGainSamplingTime);
    Ifx_Math_Pi_F16_setUpperLimit(&(self->currentQPi), self->param->currentQPiUpperLimitQ15);
    Ifx_Math_Pi_F16_setLowerLimit(&(self->currentQPi), self->param->currentQPiLowerLimitQ15);
}


static inline void Ifx_MDA_FocController_F16_initQPi(Ifx_MDA_FocController_F16* self)
{
    /* Convert the gains to Q format */
    Ifx_Math_Fract16Q propGain;
    Ifx_Math_Fract16Q integGainSamplingTime;
    Ifx_Math_Fract16Q antiWindupGainSamplingTime;
    Ifx_MDA_FocController_F16_convQPiGainsToQ(self->param, &propGain, &integGainSamplingTime,
        &antiWindupGainSamplingTime);

    /* Initialize the q formats for the Q current PI controller */
    Ifx_Math_Pi_F16_Qformats piQForm = {
        .qFormatError = Ifx_Math_FractQFormat_q14, .qFormatOutput = Ifx_Math_FractQFormat_q15
    };

    /* Initialize the q formats for the Q current PI controller */
    Ifx_Math_Pi_F16_init(&(self->currentQPi), piQForm);

    /* Initialize the dynamic parameters of the Q current PI controller */
    Ifx_MDA_FocController_F16_initQPiDynParam(self, propGain, integGainSamplingTime, antiWindupGainSamplingTime);

    /* Set antiwindup flag to inactive */
    self->p_qAntiwindupCtrl = Ifx_Math_Pi_F16_AntiWindupCtrl_no;
}


#if IFX_MDA_FOCCONTROLLER_F16_CFG_DQDECOUPLINGENABLE

/* Functions called by Ifx_MDA_FocController_F16_execute() */
static inline void Ifx_MDA_FocController_F16_dqDecoupling(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                          electricalSpeed)
{
    /* Calculate and apply d-q decoupling */
    Ifx_Math_CmpFract16 compensationVoltageDQ = Ifx_Math_DqDecoupling_F16_execute(&(self->dqDecoupling),
        self->currentDQ, electricalSpeed);
    self->voltageDQ.real = Ifx_Math_SubSat_F16(self->voltageDQ.real, compensationVoltageDQ.real);
    self->voltageDQ.imag = Ifx_Math_AddSat_F16(self->voltageDQ.imag, compensationVoltageDQ.imag);
}


