Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MDA_FocController_F16.c
#endif /* IFX_MDA_FOCCONTROLLER_F16_CFG_DQDECOUPLINGENABLE */

#if IFX_MDA_FOCCONTROLLER_F16_CFG_LIMIT_VOLT_VECTOR_D_PRIO
static inline void Ifx_MDA_FocController_F16_limitDQVoltage(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                            dcLinkVoltageQ15)
{
    /* Calculate maximum modulation amplitude based on actual DC-Link voltage  */
    Ifx_Math_Fract16 maxAmpQ15 = Ifx_Math_MulSat_F16(dcLinkVoltageQ15, IFX_MDA_FOCCONTROLLER_F16_CONST_MI_0907_Q15);

    /* Limit D voltage to max. amplitude */
    Ifx_MDA_FocController_F16_limitDVoltage(self, maxAmpQ15);

    /* Limit Q voltage to the remaining available voltage vector */
    Ifx_MDA_FocController_F16_limitQVoltage(self, maxAmpQ15);
}


static inline void Ifx_MDA_FocController_F16_limitDVoltage(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                           maxAmpQ15)
{
    if (Ifx_Math_Abs_F16(self->voltageDQ.real) >= maxAmpQ15)
    {
        /* Check D voltage sign */
        if (self->voltageDQ.real >= 0)
        {
            /* Set D antiwindup flag to positive saturation */
            self->p_dAntiwindupCtrl = Ifx_Math_Pi_F16_AntiWindupCtrl_pos;

            /* Limit positive D */
            self->voltageDQ.real = maxAmpQ15;
        }
        else
        {
            /* Set D antiwindup flag to negative saturation */
            self->p_dAntiwindupCtrl = Ifx_Math_Pi_F16_AntiWindupCtrl_neg;

            /* Limit negative D */
            self->voltageDQ.real = Ifx_Math_Neg_F16(maxAmpQ15);
        }
    }
    else
    {
        /* Set D antiwindup flag to no saturation */
        self->p_dAntiwindupCtrl = Ifx_Math_Pi_F16_AntiWindupCtrl_no;
    }
}


static inline void Ifx_MDA_FocController_F16_limitQVoltage(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                           maxAmpQ15)
{
    /* Calculate square of maximum modulation amplitude */
    Ifx_Math_Fract16 maxAmpSqrQ15 = Ifx_Math_MulShR_F16(maxAmpQ15, maxAmpQ15, 15u);

    /* ud^2 = ud*ud */
    Ifx_Math_Fract16 realVoltSqr = Ifx_Math_MulShR_F16(self->voltageDQ.real, self->voltageDQ.real, 15u);

    /* uq^2 = ulim^2 -ud^2 */
    Ifx_Math_Fract16 imagVoltSqr = Ifx_Math_Sub_F16(maxAmpSqrQ15, realVoltSqr);

    /* uq = sqrt(uq^2) */
    Ifx_Math_Fract16 imagVoltAbs = Ifx_Math_Interp1DLut_F16(imagVoltSqr, focControllerInterp1DLut,
        IFX_MDA_FOCCONTROLLER_F16_SHIFT);

    /* Limit Q voltage to sqrt(Umax^2-ud^2) */
    if (Ifx_Math_Abs_F16(self->voltageDQ.imag) >= imagVoltAbs)
    {
        /* Check Q voltage sign */
        if (self->voltageDQ.imag >= 0)
        {
            /* Set Q antiwindup flag to positive saturation */
            self->p_qAntiwindupCtrl = Ifx_Math_Pi_F16_AntiWindupCtrl_pos;

            /* Limit positive Q */
            self->voltageDQ.imag = imagVoltAbs;
        }
        else
        {
            /* Set Q antiwindup flag to negative saturation */
            self->p_qAntiwindupCtrl = Ifx_Math_Pi_F16_AntiWindupCtrl_neg;

            /* Limit negative Q */
            self->voltageDQ.imag = Ifx_Math_Neg_F16(imagVoltAbs);
        }
    }
    else
    {
        /* Set Q antiwindup flag to no saturation */
        self->p_qAntiwindupCtrl = Ifx_Math_Pi_F16_AntiWindupCtrl_no;
    }
}


#endif /* IFX_MDA_FOCCONTROLLER_F16_CFG_LIMIT_VOLT_VECTOR_D_PRIO */
void Ifx_MDA_FocController_F16_setCurrentDPiLowerLimit(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                       currentDPiLowerLimit)
{
    /* Set internal parameter */
    self->param->currentDPiLowerLimitQ15 = currentDPiLowerLimit;

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setLowerLimit(&(self->currentDPi), currentDPiLowerLimit);
}


void Ifx_MDA_FocController_F16_setCurrentDPiUpperLimit(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                       currentDPiUpperLimit)
{
    /* Set internal parameter */
    self->param->currentDPiUpperLimitQ15 = currentDPiUpperLimit;

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setUpperLimit(&(self->currentDPi), currentDPiUpperLimit);
}


void Ifx_MDA_FocController_F16_setCurrentQPiLowerLimit(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                       currentQPiLowerLimit)
{
    /* Set internal parameter */
    self->param->currentQPiLowerLimitQ15 = currentQPiLowerLimit;

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setLowerLimit(&(self->currentQPi), currentQPiLowerLimit);
}


void Ifx_MDA_FocController_F16_setCurrentQPiUpperLimit(Ifx_MDA_FocController_F16* self, Ifx_Math_Fract16
                                                       currentQPiUpperLimit)
{
    /* Set internal parameter */
    self->param->currentQPiUpperLimitQ15 = currentQPiUpperLimit;

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setUpperLimit(&(self->currentQPi), currentQPiUpperLimit);
}


uint32_t Ifx_MDA_FocController_F16_getCurrentDPiPropGain(Ifx_MDA_FocController_F16* self)
{
    return self->param->currentDPiPropGain;
}


void Ifx_MDA_FocController_F16_setCurrentDPiPropGain(Ifx_MDA_FocController_F16* self, uint32_t propGain)
{
    /* Set internal parameter */
    self->param->currentDPiPropGain = propGain;

    /* Get the gain in Q format */
    Ifx_Math_Fract16Q propGainQ = Ifx_Math_ConvToQForm_F16(propGain, IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setPropGain(&(self->currentDPi), propGainQ);
}


uint32_t Ifx_MDA_FocController_F16_getCurrentDPiIntegGainSamplingTime(Ifx_MDA_FocController_F16* self)
{
    return self->param->currentDPiIntegGainSamplingTime;
}


void Ifx_MDA_FocController_F16_setCurrentDPiIntegGainSamplingTime(Ifx_MDA_FocController_F16* self, uint32_t
                                                                  integGainSamplingTime)
{
    /* Set internal parameter */
    self->param->currentDPiIntegGainSamplingTime = integGainSamplingTime;

    /* Get the gain in Q format */
    Ifx_Math_Fract16Q integGainSamplingTimeQ = Ifx_Math_ConvToQForm_F16(integGainSamplingTime,
        IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setIntegGainSamplingTime(&(self->currentDPi), integGainSamplingTimeQ);
}


uint32_t Ifx_MDA_FocController_F16_getCurrentQPiPropGain(Ifx_MDA_FocController_F16* self)
{
    return self->param->currentQPiPropGain;
}


