Titleyy/Yao/TLE987x_FOC_BASIC_Sensorless_Example/components/ifx_motorcontrol_v1/src/Ifx_MDA_FocController_F16.c
void Ifx_MDA_FocController_F16_setCurrentQPiPropGain(Ifx_MDA_FocController_F16* self, uint32_t propGain)
{
    /* Set internal parameter */
    self->param->currentQPiPropGain = propGain;

    /* Get the gain in Q format */
    Ifx_Math_Fract16Q propGainQ = Ifx_Math_ConvToQForm_F16(propGain, IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setPropGain(&(self->currentQPi), propGainQ);
}


uint32_t Ifx_MDA_FocController_F16_getCurrentQPiIntegGainSamplingTime(Ifx_MDA_FocController_F16* self)
{
    return self->param->currentQPiIntegGainSamplingTime;
}


void Ifx_MDA_FocController_F16_setCurrentQPiIntegGainSamplingTime(Ifx_MDA_FocController_F16* self, uint32_t
                                                                  integGainSamplingTime)
{
    /* Set internal parameter */
    self->param->currentQPiIntegGainSamplingTime = integGainSamplingTime;

    /* Get the gain in Q format */
    Ifx_Math_Fract16Q integGainSamplingTimeQ = Ifx_Math_ConvToQForm_F16(integGainSamplingTime,
        IFX_MDA_FOCCONTROLLER_F16_PI_SCALING_FACTOR_TU);

    /* Call PI controller setter */
    Ifx_Math_Pi_F16_setIntegGainSamplingTime(&(self->currentQPi), integGainSamplingTimeQ);
}


Ifx_Math_Pi_F16_AntiWindupCtrl Ifx_MDA_FocController_F16_getQVoltageSatStatus(Ifx_MDA_FocController_F16* self)
{
    Ifx_Math_Pi_F16_AntiWindupCtrl qVoltageSatStatus;

    /* Get the saturation status of the Q PI controller */
    Ifx_Math_Pi_F16_AntiWindupCtrl qVoltageSatStatusIntern = Ifx_Math_Pi_F16_getSaturationStatus(&(self->currentQPi));

    /* Check internal and external saturation status */
    if ((qVoltageSatStatusIntern == Ifx_Math_Pi_F16_AntiWindupCtrl_no)
        && (self->p_qAntiwindupCtrl == Ifx_Math_Pi_F16_AntiWindupCtrl_no))
    {
        qVoltageSatStatus = Ifx_Math_Pi_F16_AntiWindupCtrl_no;
    }
    else if ((qVoltageSatStatusIntern == Ifx_Math_Pi_F16_AntiWindupCtrl_neg)
             || (self->p_qAntiwindupCtrl == Ifx_Math_Pi_F16_AntiWindupCtrl_neg))
    {
        qVoltageSatStatus = Ifx_Math_Pi_F16_AntiWindupCtrl_neg;
    }
    else
    {
        qVoltageSatStatus = Ifx_Math_Pi_F16_AntiWindupCtrl_pos;
    }

    return qVoltageSatStatus;
}
